RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/adc_reg.h
#define ADC_CTL_MST_Pos                  (8)                                               /*!< ADC_T::CTL: MST Position               */
#define ADC_CTL_MST_Msk                  (0x1ul << ADC_CTL_MST_Pos)                        /*!< ADC_T::CTL: MST Mask                   */

#define ADC_CTL_PEDEEN_Pos               (9)                                               /*!< ADC_T::CTL: PEDEEN Position            */
#define ADC_CTL_PEDEEN_Msk               (0x1ul << ADC_CTL_PEDEEN_Pos)                     /*!< ADC_T::CTL: PEDEEN Mask                */

#define ADC_CTL_WKTEN_Pos                (11)                                              /*!< ADC_T::CTL: WKTEN Position             */
#define ADC_CTL_WKTEN_Msk                (0x1ul << ADC_CTL_WKTEN_Pos)                      /*!< ADC_T::CTL: WKTEN Mask                 */

#define ADC_CTL_WMSWCH_Pos               (16)                                              /*!< ADC_T::CTL: WMSWCH Position            */
#define ADC_CTL_WMSWCH_Msk               (0x1ul << ADC_CTL_WMSWCH_Pos)                     /*!< ADC_T::CTL: WMSWCH Mask                */

#define ADC_CONF_TEN_Pos                 (0)                                               /*!< ADC_T::CONF: TEN Position              */
#define ADC_CONF_TEN_Msk                 (0x1ul << ADC_CONF_TEN_Pos)                       /*!< ADC_T::CONF: TEN Mask                  */

#define ADC_CONF_ZEN_Pos                 (1)                                               /*!< ADC_T::CONF: ZEN Position              */
#define ADC_CONF_ZEN_Msk                 (0x1ul << ADC_CONF_ZEN_Pos)                       /*!< ADC_T::CONF: ZEN Mask                  */

#define ADC_CONF_NACEN_Pos               (2)                                               /*!< ADC_T::CONF: NACEN Position            */
#define ADC_CONF_NACEN_Msk               (0x1ul << ADC_CONF_NACEN_Pos)                     /*!< ADC_T::CONF: NACEN Mask                */

#define ADC_CONF_REFSEL_Pos              (6)                                               /*!< ADC_T::CONF: REFSEL Position           */
#define ADC_CONF_REFSEL_Msk              (0x3ul << ADC_CONF_REFSEL_Pos)                    /*!< ADC_T::CONF: REFSEL Mask               */

#define ADC_CONF_CHSEL_Pos               (12)                                              /*!< ADC_T::CONF: CHSEL Position            */
#define ADC_CONF_CHSEL_Msk               (0x7ul << ADC_CONF_CHSEL_Pos)                     /*!< ADC_T::CONF: CHSEL Mask                */

#define ADC_CONF_TMAVDIS_Pos             (20)                                              /*!< ADC_T::CONF: TMAVDIS Position          */
#define ADC_CONF_TMAVDIS_Msk             (0x1ul << ADC_CONF_TMAVDIS_Pos)                   /*!< ADC_T::CONF: TMAVDIS Mask              */

#define ADC_CONF_ZMAVDIS_Pos             (21)                                              /*!< ADC_T::CONF: ZMAVDIS Position          */
#define ADC_CONF_ZMAVDIS_Msk             (0x1ul << ADC_CONF_ZMAVDIS_Pos)                   /*!< ADC_T::CONF: ZMAVDIS Mask              */

#define ADC_CONF_SPEED_Pos               (22)                                              /*!< ADC_T::CONF: SPEED Position            */
#define ADC_CONF_SPEED_Msk               (0x1ul << ADC_CONF_SPEED_Pos)                     /*!< ADC_T::CONF: SPEED Mask                */

#define ADC_IER_MIEN_Pos                 (0)                                               /*!< ADC_T::IER: MIEN Position              */
#define ADC_IER_MIEN_Msk                 (0x1ul << ADC_IER_MIEN_Pos)                       /*!< ADC_T::IER: MIEN Mask                  */

#define ADC_IER_PEDEIEN_Pos              (2)                                               /*!< ADC_T::IER: PEDEIEN Position           */
#define ADC_IER_PEDEIEN_Msk              (0x1ul << ADC_IER_PEDEIEN_Pos)                    /*!< ADC_T::IER: PEDEIEN Mask               */

#define ADC_IER_WKTIEN_Pos               (3)                                               /*!< ADC_T::IER: WKTIEN Position            */
#define ADC_IER_WKTIEN_Msk               (0x1ul << ADC_IER_WKTIEN_Pos)                     /*!< ADC_T::IER: WKTIEN Mask                */

#define ADC_IER_PEUEIEN_Pos              (6)                                               /*!< ADC_T::IER: PEUEIEN Position           */
#define ADC_IER_PEUEIEN_Msk              (0x1ul << ADC_IER_PEUEIEN_Pos)                    /*!< ADC_T::IER: PEUEIEN Mask               */

#define ADC_ISR_MF_Pos                   (0)                                               /*!< ADC_T::ISR: MF Position                */
#define ADC_ISR_MF_Msk                   (0x1ul << ADC_ISR_MF_Pos)                         /*!< ADC_T::ISR: MF Mask                    */

#define ADC_ISR_PEDEF_Pos                (2)                                               /*!< ADC_T::ISR: PEDEF Position             */
#define ADC_ISR_PEDEF_Msk                (0x1ul << ADC_ISR_PEDEF_Pos)                      /*!< ADC_T::ISR: PEDEF Mask                 */

#define ADC_ISR_PEUEF_Pos                (4)                                               /*!< ADC_T::ISR: PEUEF Position             */
#define ADC_ISR_PEUEF_Msk                (0x1ul << ADC_ISR_PEUEF_Pos)                      /*!< ADC_T::ISR: PEUEF Mask                 */

#define ADC_ISR_TF_Pos                   (8)                                               /*!< ADC_T::ISR: TF Position                */
#define ADC_ISR_TF_Msk                   (0x1ul << ADC_ISR_TF_Pos)                         /*!< ADC_T::ISR: TF Mask                    */

#define ADC_ISR_ZF_Pos                   (9)                                               /*!< ADC_T::ISR: ZF Position                */
#define ADC_ISR_ZF_Msk                   (0x1ul << ADC_ISR_ZF_Pos)                         /*!< ADC_T::ISR: ZF Mask                    */

#define ADC_ISR_NACF_Pos                 (10)                                              /*!< ADC_T::ISR: NACF Position              */
#define ADC_ISR_NACF_Msk                 (0x1ul << ADC_ISR_NACF_Pos)                       /*!< ADC_T::ISR: NACF Mask                  */

#define ADC_ISR_INTTC_Pos                (17)                                              /*!< ADC_T::ISR: INTTC Position             */
#define ADC_ISR_INTTC_Msk                (0x1ul << ADC_ISR_INTTC_Pos)                      /*!< ADC_T::ISR: INTTC Mask                 */

