RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/adc_reg.h
#define ADC_WKISR_WPEDEF_Pos             (1)                                               /*!< ADC_T::WKISR: WPEDEF Position          */
#define ADC_WKISR_WPEDEF_Msk             (0x1ul << ADC_WKISR_WPEDEF_Pos)                   /*!< ADC_T::WKISR: WPEDEF Mask              */

#define ADC_XYDATA_XDATA_Pos             (0)                                               /*!< ADC_T::XYDATA: XDATA Position          */
#define ADC_XYDATA_XDATA_Msk             (0xffful << ADC_XYDATA_XDATA_Pos)                 /*!< ADC_T::XYDATA: XDATA Mask              */

#define ADC_XYDATA_YDATA_Pos             (16)                                              /*!< ADC_T::XYDATA: YDATA Position          */
#define ADC_XYDATA_YDATA_Msk             (0xffful << ADC_XYDATA_YDATA_Pos)                 /*!< ADC_T::XYDATA: YDATA Mask              */

#define ADC_ZDATA_Z1DATA_Pos             (0)                                               /*!< ADC_T::ZDATA: Z1DATA Position          */
#define ADC_ZDATA_Z1DATA_Msk             (0xffful << ADC_ZDATA_Z1DATA_Pos)                 /*!< ADC_T::ZDATA: Z1DATA Mask              */

#define ADC_ZDATA_Z2DATA_Pos             (16)                                              /*!< ADC_T::ZDATA: Z2DATA Position          */
#define ADC_ZDATA_Z2DATA_Msk             (0xffful << ADC_ZDATA_Z2DATA_Pos)                 /*!< ADC_T::ZDATA: Z2DATA Mask              */

#define ADC_DATA_ADCDATA_Pos             (0)                                               /*!< ADC_T::DATA: ADCDATA Position          */
#define ADC_DATA_ADCDATA_Msk             (0xffful << ADC_DATA_ADCDATA_Pos)                 /*!< ADC_T::DATA: ADCDATA Mask              */

#define ADC_XYSORT_XSORT_Pos             (0)                                               /*!< ADC_T::XYSORT: XSORT Position          */
#define ADC_XYSORT_XSORT_Msk             (0xffful << ADC_XYSORT_XSORT_Pos)                 /*!< ADC_T::XYSORT: XSORT Mask              */

#define ADC_XYSORT_YSORT_Pos             (16)                                              /*!< ADC_T::XYSORT: YSORT Position          */
#define ADC_XYSORT_YSORT_Msk             (0xffful << ADC_XYSORT_YSORT_Pos)                 /*!< ADC_T::XYSORT: YSORT Mask              */

#define ADC_ZSORT_Z1SORT_Pos             (0)                                               /*!< ADC_T::ZSORT: Z1SORT Position          */
#define ADC_ZSORT_Z1SORT_Msk             (0xffful << ADC_ZSORT_Z1SORT_Pos)                 /*!< ADC_T::ZSORT: Z1SORT Mask              */

#define ADC_ZSORT_Z2SORT_Pos             (16)                                              /*!< ADC_T::ZSORT: Z2SORT Position          */
#define ADC_ZSORT_Z2SORT_Msk             (0xffful << ADC_ZSORT_Z2SORT_Pos)                 /*!< ADC_T::ZSORT: Z2SORT Mask              */

/**@}*/ /* ADC_CONST */
/**@}*/ /* end of ADC register group */
/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif  //__ADC_REG_H__


